In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import random

from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

from sklearn.metrics import confusion_matrix
from sklearn.metrics import roc_curve, auc
from math import isnan

In [3]:
data = pd.read_csv('gold_clean.csv')
data = data.rename(columns = {'ts': 'unixtime'})
data['ts'] = pd.to_datetime(data.unixtime)
data = data[(data.ts >= '2018-02-10') & (data.ts <= '2018-02-22')]

print(f'len(data) = {len(data)}')
data.head()

len(data) = 10792

,unixtime,open,high,low,close,vol,ts
39280,1518220800000000000,1316.7,1317.1,1316.7,1317.0,259,2018-02-10 00:00:00
39281,1518220860000000000,1317.0,1317.0,1316.6,1316.7,103,2018-02-10 00:01:00
39282,1518220920000000000,1316.8,1317.1,1316.7,1317.1,139,2018-02-10 00:02:00
39283,1518220980000000000,1317.0,1317.6,1317.0,1317.5,198,2018-02-10 00:03:00
39284,1518221040000000000,1317.6,1318.3,1317.6,1318.1,218,2018-02-10 00:04:00

In [4]:
train, test = np.split(data, [int(0.6*len(data))])

In [5]:
test.head()

,unixtime,open,high,low,close,vol,ts
45755,1518800460000000000,1358.0,1358.0,1356.6,1356.6,934,2018-02-16 17:01:00
45756,1518800520000000000,1356.7,1357.2,1356.3,1356.4,665,2018-02-16 17:02:00
45757,1518800580000000000,1356.4,1356.6,1355.8,1356.5,678,2018-02-16 17:03:00
45758,1518800640000000000,1356.5,1357.0,1356.5,1356.9,253,2018-02-16 17:04:00
45759,1518800700000000000,1356.9,1356.9,1356.4,1356.7,304,2018-02-16 17:05:00

In [13]:
test.iloc[0]

unixtime    1518800460000000000
open                       1358
high                       1358
low                      1356.6
close                    1356.6
vol                         934
ts          2018-02-16 17:01:00
Name: 45755, dtype: object

In [ ]:
train, test = np.split(data, [int(0.6*len(data))])

In [ ]:
def multySplit(d, N, m):
    return np.array_split

In [28]:
train, test = np.split(data, [int((3/5)*len(data))-1])

In [29]:
len(data), len(train), len(test)

(10792, 6474, 4318)

In [30]:
train.tail()

,unixtime,open,high,low,close,vol,ts
45749,1518800100000000000,1358.6,1358.8,1358.3,1358.3,236,2018-02-16 16:55:00
45750,1518800160000000000,1358.3,1358.9,1358.2,1358.7,344,2018-02-16 16:56:00
45751,1518800220000000000,1358.7,1358.7,1358.2,1358.2,244,2018-02-16 16:57:00
45752,1518800280000000000,1358.2,1358.4,1358.2,1358.2,100,2018-02-16 16:58:00
45753,1518800340000000000,1358.2,1358.4,1358.0,1358.2,293,2018-02-16 16:59:00

In [ ]:
training_size = i * n_samples / (n_splits + 1) + n_samples % (n_splits + 1)
test_size = n_samples / (n_splits + 1)